In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('house.csv')

In [16]:
df.head()

,bedrooms,bathrooms,sqft_living,sqft_lot,yr_built,zipcode,lat,long,price
0,3,1.00,1180,5650,1955,98178,47.5112,-122.257,221900
1,3,2.25,2570,7242,1951,98125,47.7210,-122.319,538000
2,2,1.00,770,10000,1933,98028,47.7379,-122.233,180000
3,4,3.00,1960,5000,1965,98136,47.5208,-122.393,604000
4,3,2.00,1680,8080,1987,98074,47.6168,-122.045,510000

### Basic Info

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6007 entries, 0 to 6006
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   bedrooms     6007 non-null   int64
 1   bathrooms    6007 non-null   float64
 2   sqft_living  6007 non-null   int64
 3   sqft_lot     6007 non-null   int64
 4   yr_built     6007 non-null   int64
 5   zipcode      6007 non-null   int64
 6   lat          6007 non-null   float64
 7   long         6007 non-null   float64
 8   price        6007 non-null   int64
dtypes: float64(3), int64(6)
memory usage: 422.5 KB

In [4]:
df.describe()

,bedrooms,bathrooms,sqft_living,sqft_lot,yr_built,zipcode,lat,long,price
count,6007.000000,6007.000000,6007.000000,6.007000e+03,6007.000000,6007.000000,6007.000000,6007.000000,6.007000e+03
mean,3.376228,2.067088,2064.112202,1.597509e+04,1966.936075,98077.920926,47.560244,-122.214033,5.378717e+05
std,0.896744,0.763731,914.197376,4.391224e+04,28.250012,53.955535,0.139884,0.140329,3.774637e+05
min,1.000000,0.500000,380.000000,5.720000e+02,1900.000000,98001.000000,47.155900,-122.514000,8.000000e+04
25%,3.000000,1.500000,1410.000000,5.412500e+03,1949.000000,98033.000000,47.462900,-122.327000,3.194500e+05
50%,3.000000,2.000000,1910.000000,7.912000e+03,1969.000000,98065.000000,47.574200,-122.229000,4.500000e+05
75%,4.000000,2.500000,2510.000000,1.122750e+04,1990.000000,98118.000000,47.679450,-122.126500,6.500000e+05
max,9.000000,6.750000,10040.000000,1.651359e+06,2015.000000,98199.000000,47.777600,-121.315000,7.060000e+06

### Slice

In [10]:
df.iloc[:5,1:4] # row 0-4, col 1-3

   bathrooms  sqft_living  sqft_lot
0       1.00         1180      5650
1       2.25         2570      7242
2       1.00          770     10000
3       3.00         1960      5000
4       2.00         1680      8080

In [19]:
df.iloc[:5:2,1:4] # row 0-4, col 1-3, every second row, [start:end:stride]

   bathrooms  sqft_living  sqft_lot
0        1.0         1180      5650
2        1.0          770     10000
4        2.0         1680      8080

In [23]:
df.loc[:,'bathrooms':'zipcode'] # using col names, all rows with cols from bathrooms to zipcode

      bathrooms  sqft_living  sqft_lot  yr_built  zipcode
0          1.00         1180      5650      1955    98178
1          2.25         2570      7242      1951    98125
2          1.00          770     10000      1933    98028
3          3.00         1960      5000      1965    98136
4          2.00         1680      8080      1987    98074
...         ...          ...       ...       ...      ...
6002       1.00         1450      9586      1950    98155
6003       2.25         2870      6280      1905    98112
6004       2.00         1870     13970      1969    98027
6005       3.50         2490     18042      2003    98070
6006       2.50         3350      4501      2002    98117

[6007 rows x 5 columns]

In [30]:
beds = df.loc[:,'bedrooms']

#### Broadcast

In [31]:
beds.iloc[:10:3] = np.nan #assigning nan to every 3rd row between 0 and 9

In [33]:
beds.head(15)

0     NaN
1     3.0
2     2.0
3     NaN
4     3.0
5     4.0
6     NaN
7     3.0
8     3.0
9     NaN
10    3.0
11    2.0
12    3.0
13    3.0
14    5.0
Name: bedrooms, dtype: float64

#### Building df from lists

In [35]:
bath = df.loc[:,'bathrooms']

In [36]:
columns = [beds, bath] # column data as list

In [37]:
labels = ['bedrooms', 'bathrooms'] # column headings

In [38]:
zipped = list(zip(labels,columns)) #zip together

In [43]:
zipped

[('bedrooms',
  0       NaN
  1       3.0
  2       2.0
  3       NaN
  4       3.0
         ...
  6002    3.0
  6003    4.0
  6004    5.0
  6005    4.0
  6006    4.0
  Name: bedrooms, Length: 6007, dtype: float64),
 ('bathrooms',
  0       1.00
  1       2.25
  2       1.00
  3       3.00
  4       2.00
          ...
  6002    1.00
  6003    2.25
  6004    2.00
  6005    3.50
  6006    2.50
  Name: bathrooms, Length: 6007, dtype: float64)]

In [39]:
bedbath = dict(zipped) #create a dictionary

In [40]:
bedbath

{'bedrooms': 0       NaN
 1       3.0
 2       2.0
 3       NaN
 4       3.0
        ...
 6002    3.0
 6003    4.0
 6004    5.0
 6005    4.0
 6006    4.0
 Name: bedrooms, Length: 6007, dtype: float64,
 'bathrooms': 0       1.00
 1       2.25
 2       1.00
 3       3.00
 4       2.00
         ...
 6002    1.00
 6003    2.25
 6004    2.00
 6005    3.50
 6006    2.50
 Name: bathrooms, Length: 6007, dtype: float64}

In [41]:
df_bedbath = pd.DataFrame(bedbath) # create a dataframe

In [42]:
df_bedbath

      bedrooms  bathrooms
0          NaN       1.00
1          3.0       2.25
2          2.0       1.00
3          NaN       3.00
4          3.0       2.00
...        ...        ...
6002       3.0       1.00
6003       4.0       2.25
6004       5.0       2.00
6005       4.0       3.50
6006       4.0       2.50

[6007 rows x 2 columns]

In [44]:
df_bedbath['zeroes'] = 0 #creating new column, filling with zeroes

In [45]:
df_bedbath.head()

   bedrooms  bathrooms  zeroes
0       NaN       1.00       0
1       3.0       2.25       0
2       2.0       1.00       0
3       NaN       3.00       0
4       3.0       2.00       0